{
"projects":
	[
		{
			"ID":"TAAG",
			"title":"Trade at a Glance",
			"category":"Work",
			"blurb":"Australia's Trade at a Glance complements the annual Trade at a Glance publication, allowing users to investigate Australia's trade profile. It brings together information from a range of Department of Foreign Affairs and Trade publications in the one location for the first time.",
			"fullText":"Australia's Trade at a Glance complements the annual Trade at a Glance publication, allowing users to investigate Australia's trade profile. It brings together information from a range of Department of Foreign Affairs and Trade publications in the one location for the first time.</p><p>I was involved with generating content based on spreadsheets of data, exported from a SQL database. I was also involved with the functionality and style of the website, and was heavily involved with the JavaScript-based map used throughout the site.",
			"link":"http://www.dfat.gov.au/trade/resources/trade-at-a-glance/Pages/default.aspx",
			"role":"Developer/Designer"
		},
		{
			"ID":"beardys",
			"title":"Beardy's Beard Oil",
			"category":"Fun",
			"blurb":"Beardy's is a local Canberra business that produces high quality beard oil. With customers around Australia, Beardy's boasts both excellence in ingredient choice and a loyal following. Beardy's is available online and has an active and colourful social media presence. ",
			"fullText":"Beardy's is a local Canberra business that produces high quality beard oil. With customers around Australia, Beardy's boasts both excellence in ingredient choice and a loyal following. Beardy's is available online and has an active and colourful social media presence.</p><p>I created Beardy's first website, and set up a payment system so that the product could be ordered from within the website. I was also heavily involved with the design of the site, and helping the business gain <a href='http://www.canberratimes.com.au/act-news/canberra-life/christmas-gift-guide-for-canberra-sporting-mad-with-beards-20141213-11xjul.html' target='_blank'>local media coverage</a>. ",
			"link":"http://beardys.com.au/",
			"role":"Web Developer/Designer"
		},
		{
			"ID":"techLauncher",
			"title":"TechLauncher at ANU",
			"category":"Work",
			"blurb":"TechLauncher is an ANU initiative which enables students from any discipline to work towards creating software start-ups whilst guided by industry mentors, or with industry professionals on real-world projects. Students address complex problems across a variety of disciplines and industries.",
			"fullText":"TechLauncher is an initiative of the Australian National University which enables students from any discipline to work towards creating software start-ups whilst guided by industry mentors, or with industry professionals on real-world projects. </p><p>I have been involved with the launch of the initiative, in a management sense (engaging and managing stakeholders, gathering requirements from participants and co-ordinating schedules), a technical sense (building the website and integrating it with the ANU systems) and an administrative sense. </p><p>As a student at ANU, I was passionate about forming pathways from the university to the innovation sector. TechLauncher has been a <a href=' http://www.anu.edu.au/news/all-news/anu-student-ideas-to-come-to-life-with-techlauncher' target='_blank'>leader in the university</a> ecosystem for setting up these avenues for students, and has established strong ties with the wider technical community. ",
			"link":"http://cs.anu.edu.au/TechLauncher",
			"role":"Launch Co-ordinator"
		},
		{
			"ID":"XMDS",
			"title":"XMDS2",
			"category":"Academic",
			"blurb":"XMDS2 is an open source software package that allows a variety of differential equations to be solved using a set of efficient numerical algorithms. The contributions made by our team formed a significant part of the XMDS 2.2.0 release, benefiting the users from over 70 countries that rely on the system.",
			"fullText":"XMDS2 is an open source software package that allows a variety of differential equations to be solved using a set of efficient numerical algorithms. The contributions made by our team formed a significant part of the <a href='http://xmds.org/#xmds-2-2-0-out-of-cheese-error-january-13-2014' target='_blank'>XMDS 2.2.0 release</a>, benefiting the users from over 70 countries that rely on the system.</p><p>I worked on XMDS2 as part of my year-long group project course at the Australian National University. This project involved both technical ability (creating C++ code, generated by Python Cheetah templates, instructed by XML models) and project management skills (eliciting requirements, stakeholder management, regular reports, and documentation). ",
			"link":"http://www.xmds.org/",
			"role":"Developer"
		},
		{
			"ID":"thesis",
			"title":"Learning from each other: An Interdisciplinary Approach to Software Engineering",
			"category":"Academic",
			"blurb":"This thesis explores the feasibility of sharing knowledge between software engineering and other disciplines. A case study is performed between software engineering experts and mental health researchers, identifying commonalities and differences between development practices within these disciplines.",
			"fullText":"I wrote this thesis as part of my Bachelor of Software Engineering (Honours) Degree at ANU, in 2014. The goal of this project was to investigate the feasibility of interdisciplinary knowledge sharing for the purposes of improving software development practices. Mental health was identified as a candidate discipline, with emphasis on Community Based Participatory Research (CBPR). CBPR was identified as being similar in nature to Agile Software Development, and this link was investigated. </p><p> An exploratory case study was designed and executed in order to investigate links between the two practices. Experts were interviewed in each field. A general systems model was created in order to facilitate the interviews conducted throughout the case study. This model was representative of both Agile and CBPR, and was used to identify commonalities and differences between the two sets of practices.</p><p>Major findings from the study include: Participants from both software engineering and mental health research suggested practices from their own domains that may help external disciplines; Participants generally identified that their research areas were inward focused and/or silo-based; Potential opportunities from software engineering and mental health research to collaborate were identified, particularly in the areas of communication techniques, approaches to system development, and approaches to handling time constraints.</p><p> Knowledge sharing between software engineering and mental health research was considered feasible, and recommendations were given regarding future interdisciplinary work within software engineering. ",
			"link":"resources/Beard_thesis.pdf",
			"role":"Author"
		},
		{
			"ID":"kMeans",
			"title":"K-Means Document Clusterer",
			"category":"Fun",
			"blurb":"An implementation of the k-means clustering algorithm in Java. The program reads in all documents (text files) in a directory, and then clusters them based on cosine similarity. The program returns the names of the closest documents to each centroid. ",
			"fullText":"An implementation of the k-means clustering algorithm in Java. The program reads in all documents (text files) in a directory, and then clusters them based on cosine similarity. The program returns the names of the closest documents to each centroid. </p><p>I started this project as part of a university assignment for the course Document Analysis, and then extended it to make it more robust. The source code for this program is available for use and adaptation, however please cite is using (Beard, 2014). ",
			"link":"https://github.com/DamoBAus/KMeansClusterer",
			"role":"Developer"
		}
	]
}
